{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "d1_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d1", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d2_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d2", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn2_gamma", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_beta", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn2", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact2", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d3_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d3", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn3_gamma", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn3_beta", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn3", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact3", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d4_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d4", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dbn4_gamma", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_beta", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dbn4_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "dbn4", 
      "attr": {
        "eps": "1.0000001e-05", 
        "fix_gamma": "True"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "dact4", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "d5_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "d5", 
      "attr": {
        "kernel": "(4, 4)", 
        "no_bias": "True", 
        "num_filter": "1"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "logistic_label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "logistic", 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    6, 
    7, 
    8, 
    9, 
    12, 
    14, 
    15, 
    16, 
    17, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    31
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39
  ], 
  "heads": [[32, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}